RightDomain/constant/bodyForceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      bodyForceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyForceNames (discTurbine);

discTurbineCoeffs
{
        bodyForceType   disc;
	hubPosition	(0 0 -0.4);
        Nsigma          2;
	sigma		0.005;
	tipRadius	0.05;
	hubRadius	0;
	axis		(1 0 0);
	Ct		0.90;
        tSoft 0;
}

// ************************************************************************* //
