RightDomain/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 1.0 -0.3 -0.8)
    ( 5.0 -0.3 -0.8)
    ( 5.0  0.3 -0.8)
    ( 1.0  0.3 -0.8)

    ( 1.0 -0.3 0.0)
    ( 5.0 -0.3 0.0)
    ( 5.0  0.3 0.0)
    ( 1.0  0.3 0.0)
);

blocks
(
    hex ( 0 1 2 3 4 5 6 7 ) (70 16 16) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch  right_inlet
    (
           (0 3 7 4)
    )
    patch right_bottom
    (
            (1 0 4 5)
    )
    patch right_top
    (
            (3 2 6 7)

    )
    patch right_front
    (
            (2 3 0 1)
    )
    patch right_back
    (
            (5 4 7 6)
    )
    patch right_outlet       
    (
           (2 1 5 6)   
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
